In [1]:
import pandas as pd

In [2]:
pwd

'/home/priyank/Downloads/FULL_TENSORFLOW_NOTES__AND_DATA/Tensorflow-Bootcamp-master'

In [3]:
!pwd

/home/priyank/Downloads/FULL_TENSORFLOW_NOTES__AND_DATA/Tensorflow-Bootcamp-master

In [20]:
df = pd.read_csv('salaries.csv')

In [21]:
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [23]:
df[['Salary','Name']]

   Salary    Name
0   50000    John
1  120000   Sally
2   80000  Alyssa

In [28]:
df[df['Salary'] > 60000]

     Name  Salary  Age
1   Sally  120000   45
2  Alyssa   80000   27

# as numpy array

In [30]:
df.as_matrix()

array([['John', 50000, 34],
       ['Sally', 120000, 45],
       ['Alyssa', 80000, 27]], dtype=object)